{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "trainable": true, "batch_input_shape": [null, 64, 64, 1], "input_dtype": "float32", "nb_filter": 10, "nb_row": 4, "nb_col": 4, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "trainable": true, "nb_filter": 10, "nb_row": 4, "nb_col": 4, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "trainable": true, "nb_filter": 10, "nb_row": 4, "nb_col": 4, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "trainable": true, "nb_filter": 10, "nb_row": 4, "nb_col": 4, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "output_dim": 3, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 1210}}], "keras_version": "1.2.2"}